Revit 2027 API
UIThemeManager.GetThemeName Method
 Gets the theme name for the given theme type.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetThemeName(
	UITheme frameTheme
)
Public Shared Function GetThemeName (
	frameTheme As UITheme
) As String
public:
static String^ GetThemeName(
	UITheme frameTheme
)
static member GetThemeName :
        frameTheme : UITheme -> string
Parameters
frameTheme UITheme
 The theme.
Return Value
String
 The name of the theme.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
UIThemeManager Class
Autodesk.Revit.UI Namespace